/*Упражнение 4.1 Написать программу, которая читает с экрана число от 1 до 365 (номер дня
в году), переводит этот число в месяц и день месяца. Например, число 40 соответствует 9
февраля (високосный год не учитывать).*/

Console.WriteLine("Упражнение 4.1");

Console.WriteLine("Введите число от 1 до 365:");
int number = Convert.ToInt32(Console.ReadLine());


/*Упражнение 4.2 Добавить к задаче из предыдущего упражнения проверку числа введенного
пользователем. Если число меньше 1 или больше 365, программа должна вырабатывать
исключение, и выдавать на экран сообщение.*/

Console.WriteLine("Упражнение 4.2");


/*Домашнее задание 4.1 Изменить программу из упражнений 4.1 и 4.2 так, чтобы она
учитывала год (високосный или нет). Год вводится с экрана. (Год високосный, если он
делится на четыре без остатка, но если он делится на 100 без остатка, это не високосный
год. Однако, если он делится без остатка на 400, это високосный год.)*/

Console.WriteLine("Домашнее задание 4.1");

